performance/PT-06.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="5.6.3" jmeter="5.6.3" xmlns="jmeter">
  <hashTree>
    <!-- PT-06: 10用户同时分析不同请求，目标 P99 < 2s -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PT-06: 10用户同时分析不同请求" enabled="true">
      <stringProp name="TestPlan.comments">目标: P99 &lt; 2s | 场景: 10个并发用户同时分析不同requestId的执行轨迹</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>

    <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="全局变量" enabled="true">
      <collectionProp name="Arguments.arguments">
        <elementProp name="HOST" elementType="Argument">
          <stringProp name="Argument.name">HOST</stringProp>
          <stringProp name="Argument.value">localhost</stringProp>
        </elementProp>
        <elementProp name="PORT" elementType="Argument">
          <stringProp name="Argument.name">PORT</stringProp>
          <stringProp name="Argument.value">9280</stringProp>
        </elementProp>
      </collectionProp>
    </Arguments>

    <!-- 测试数据：10 个不同的 requestId -->
    <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="测试数据(requestIds)" enabled="true">
      <collectionProp name="Arguments.arguments">
        <elementProp name="REQ_01" elementType="Argument">
          <stringProp name="Argument.name">REQ_01</stringProp>
          <stringProp name="Argument.value">req_test_001</stringProp>
        </elementProp>
        <elementProp name="REQ_02" elementType="Argument">
          <stringProp name="Argument.name">REQ_02</stringProp>
          <stringProp name="Argument.value">req_test_002</stringProp>
        </elementProp>
        <elementProp name="REQ_03" elementType="Argument">
          <stringProp name="Argument.name">REQ_03</stringProp>
          <stringProp name="Argument.value">req_test_003</stringProp>
        </elementProp>
        <elementProp name="REQ_04" elementType="Argument">
          <stringProp name="Argument.name">REQ_04</stringProp>
          <stringProp name="Argument.value">req_test_004</stringProp>
        </elementProp>
        <elementProp name="REQ_05" elementType="Argument">
          <stringProp name="Argument.name">REQ_05</stringProp>
          <stringProp name="Argument.value">req_test_005</stringProp>
        </elementProp>
        <elementProp name="REQ_06" elementType="Argument">
          <stringProp name="Argument.name">REQ_06</stringProp>
          <stringProp name="Argument.value">req_test_006</stringProp>
        </elementProp>
        <elementProp name="REQ_07" elementType="Argument">
          <stringProp name="Argument.name">REQ_07</stringProp>
          <stringProp name="Argument.value">req_test_007</stringProp>
        </elementProp>
        <elementProp name="REQ_08" elementType="Argument">
          <stringProp name="Argument.name">REQ_08</stringProp>
          <stringProp name="Argument.value">req_test_008</stringProp>
        </elementProp>
        <elementProp name="REQ_09" elementType="Argument">
          <stringProp name="Argument.name">REQ_09</stringProp>
          <stringProp name="Argument.value">req_test_009</stringProp>
        </elementProp>
        <elementProp name="REQ_10" elementType="Argument">
          <stringProp name="Argument.name">REQ_10</stringProp>
          <stringProp name="Argument.value">req_test_010</stringProp>
        </elementProp>
      </collectionProp>
    </Arguments>

    <hashTree>
      <!-- 10 线程，ramp-up 2s，循环 5 次 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PT-06 ThreadGroup" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">5</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>

      <hashTree>
        <!-- 获取执行轨迹（每个线程用不同的 requestId） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/v1/requests/{requestId}/trace" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <!-- 使用 __threadNum 变量让每个线程使用不同的 requestId -->
          <stringProp name="HTTPSampler.path">/api/v1/requests/${__V(REQ_0${__threadNum})}/trace</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <stringProp name="HTTPSampler.response_timeout">15000</stringProp>
        </HTTPSamplerProxy>

        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应时间 &lt; 2s" enabled="true">
            <collectionProp name="Asserion.test_strings"/>
            <stringProp name="Assertion.custom_message">响应时间超过 2s</stringProp>
            <intProp name="Assertion.test_type">2</intProp>
            <doubleProp>
              <name>Assertion.expectedResponseTime</name>
              <value>2000</value>
            </doubleProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="汇总报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>